logs/fio-diskseq/GWDG 4v 8GB/000/log008.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;210663;822;79640;0;0;0.000000;0.000000;87;538921;1203.233824;5841.988598;1.000000%=92;5.000000%=96;10.000000%=114;20.000000%=156;30.000000%=173;40.000000%=179;50.000000%=183;60.000000%=189;70.000000%=201;80.000000%=224;90.000000%=296;95.000000%=10158;99.000000%=14614;99.500000%=14614;99.900000%=15007;99.950000%=15269;99.990000%=283115;0%=0;0%=0;0%=0;90;538926;1208.359929;5842.001179;70144;1860608;100.000000%;210876.377358;141387.428639;0.831251%;15.320383%;5555;0;16;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;6.74%;77.98%;7.14%;0.04%;0.01%;0.01%;0.03%;2.98%;5.06%;0.01%;0.01%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;vda;0;13553;0;42;0;3957229;3959292;98.68%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=1235: Sat Jan  6 00:39:20 2024
  write: IOPS=822, BW=206MiB/s (216MB/s)(16.0GiB/79640msec); 0 zone resets
    clat (usec): min=87, max=538921, avg=1203.23, stdev=5841.99
     lat (usec): min=90, max=538926, avg=1208.36, stdev=5842.00
    clat percentiles (usec):
     |  1.00th=[    93],  5.00th=[    97], 10.00th=[   115], 20.00th=[   157],
     | 30.00th=[   174], 40.00th=[   180], 50.00th=[   184], 60.00th=[   190],
     | 70.00th=[   202], 80.00th=[   225], 90.00th=[   297], 95.00th=[ 10159],
     | 99.00th=[ 14615], 99.50th=[ 14615], 99.90th=[ 15008], 99.95th=[ 15270],
     | 99.99th=[283116]
   bw (  KiB/s): min=70144, max=1860608, per=100.00%, avg=210876.38, stdev=141387.43, samples=159
   iops        : min=  274, max= 7268, avg=823.74, stdev=552.29, samples=159
  lat (usec)   : 100=6.74%, 250=77.98%, 500=7.14%, 750=0.04%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.03%, 10=2.98%, 20=5.06%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.83%, sys=15.32%, ctx=5555, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=206MiB/s (216MB/s), 206MiB/s-206MiB/s (216MB/s-216MB/s), io=16.0GiB (17.2GB), run=79640-79640msec

Disk stats (read/write):
  vda: ios=0/13553, merge=0/42, ticks=0/3957229, in_queue=3959292, util=98.68%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;122532;478;136921;0;0;0.000000;0.000000;100;208234;2081.080198;2874.019339;1.000000%=248;5.000000%=477;10.000000%=544;20.000000%=831;30.000000%=1220;40.000000%=1613;50.000000%=1859;60.000000%=2023;70.000000%=2179;80.000000%=2375;90.000000%=2965;95.000000%=4079;99.000000%=12779;99.500000%=21364;99.900000%=39583;99.950000%=49020;99.990000%=61079;0%=0;0%=0;0%=0;100;208234;2081.344842;2874.018664;8192;153600;100.000000%;122579.849817;22643.260814;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.220567%;8.372772%;66063;0;78;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;1.01%;5.69%;11.13%;6.29%;34.68%;36.00%;3.89%;0.76%;0.52%;0.04%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65518;633;0;5;262044;77657;339910;99.66%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=1238: Sat Jan  6 00:41:40 2024
  read: IOPS=478, BW=120MiB/s (125MB/s)(16.0GiB/136921msec)
    clat (usec): min=100, max=208234, avg=2081.08, stdev=2874.02
     lat (usec): min=100, max=208234, avg=2081.34, stdev=2874.02
    clat percentiles (usec):
     |  1.00th=[  249],  5.00th=[  478], 10.00th=[  545], 20.00th=[  832],
     | 30.00th=[ 1221], 40.00th=[ 1614], 50.00th=[ 1860], 60.00th=[ 2024],
     | 70.00th=[ 2180], 80.00th=[ 2376], 90.00th=[ 2966], 95.00th=[ 4080],
     | 99.00th=[12780], 99.50th=[21365], 99.90th=[39584], 99.95th=[49021],
     | 99.99th=[61080]
   bw (  KiB/s): min= 8192, max=153600, per=100.00%, avg=122579.85, stdev=22643.26, samples=273
   iops        : min=   32, max=  600, avg=478.82, stdev=88.47, samples=273
  lat (usec)   : 250=1.01%, 500=5.69%, 750=11.13%, 1000=6.29%
  lat (msec)   : 2=34.68%, 4=36.00%, 10=3.89%, 20=0.76%, 50=0.52%
  lat (msec)   : 100=0.04%, 250=0.01%
  cpu          : usr=0.22%, sys=8.37%, ctx=66063, majf=0, minf=78
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=120MiB/s (125MB/s), 120MiB/s-120MiB/s (125MB/s-125MB/s), io=16.0GiB (17.2GB), run=136921-136921msec

Disk stats (read/write):
  vda: ios=65518/633, merge=0/5, ticks=262044/77657, in_queue=339910, util=99.66%